       IDENTIFICATION DIVISION.

       PROGRAM-ID. GENERAR-VAL-HORA.

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.

           SELECT VAL ASSIGN TO "VAL-HORA.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.

       FILE SECTION.

       FD VAL.
       01 REG-VAL.
           03 VAL-CONS PIC 9(3).
           03 VAL-FEC-DESDE PIC X(8).
           03 VAL-FEC-HASTA PIC X(8).
           03 VAL-VALOR-HORA PIC 9(7)V99.

       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
      
       MAIN-PROCEDURE.

           DISPLAY "Generando VAL-HORA.DAT".
           OPEN OUTPUT VAL.

           MOVE 1 TO VAL-CONS.
           MOVE "2013/03/13" TO VAL-FEC-DESDE.
           MOVE "2014/10/13" TO VAL-FEC-HASTA.
           MOVE 30 TO VAL-VALOR-HORA.
           WRITE REG-VAL.

           MOVE 49 TO VAL-CONS.
           MOVE "2012/02/15" TO VAL-FEC-DESDE.
           MOVE "2014/10/13" TO VAL-FEC-HASTA.
           MOVE 35 TO VAL-VALOR-HORA.
           WRITE REG-VAL.

           MOVE 50 TO VAL-CONS.
           MOVE "2010/10/15" TO VAL-FEC-DESDE.
           MOVE "2014/10/13" TO VAL-FEC-HASTA.
           MOVE 25 TO VAL-VALOR-HORA.
           WRITE REG-VAL.

           MOVE 99 TO VAL-CONS.
           MOVE "2014/01/15" TO VAL-FEC-DESDE.
           MOVE "2014/10/13" TO VAL-FEC-HASTA.
           MOVE 30 TO VAL-VALOR-HORA.
           WRITE REG-VAL.

           CLOSE VAL.
           STOP RUN.

       END PROGRAM GENERAR-VAL-HORA.
