       IDENTIFICATION DIVISION.

       PROGRAM-ID. GENERAR-VAL-HORA.

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.

           SELECT VAL ASSIGN TO "VAL-HORA.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.

       FILE SECTION.

       FD VAL.
       01 REG-VAL.
           03 VAL-CONS PIC 9(3).
           03 VAL-FEC-DESDE PIC X(8).
           03 VAL-FEC-HASTA PIC X(8).
           03 VAL-VALOR-HORA PIC 9(7)V99.

       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
      
       MAIN-PROCEDURE.

           DISPLAY "Generando VAL-HORA.DAT".
           OPEN OUTPUT VAL.



           MOVE 1 TO VAL-CONS.
           MOVE "20130313" TO VAL-FEC-DESDE.
           MOVE "20141013" TO VAL-FEC-HASTA.
           MOVE 30 TO VAL-VALOR-HORA.
           WRITE REG-VAL.

           
           MOVE 49 TO VAL-CONS.
           MOVE "20120215" TO VAL-FEC-DESDE.
           MOVE "20141013" TO VAL-FEC-HASTA.
           MOVE 35 TO VAL-VALOR-HORA.
           WRITE REG-VAL.

           MOVE 50 TO VAL-CONS.
           MOVE "20101015" TO VAL-FEC-DESDE.
           MOVE "20141013" TO VAL-FEC-HASTA.
           MOVE 25 TO VAL-VALOR-HORA.
           WRITE REG-VAL.
           
           MOVE 99 TO VAL-CONS.
           MOVE "20140115" TO VAL-FEC-DESDE.
           MOVE "20141013" TO VAL-FEC-HASTA.
           MOVE 30 TO VAL-VALOR-HORA.
           WRITE REG-VAL.

           CLOSE VAL.
           STOP RUN.

       END PROGRAM GENERAR-VAL-HORA.
